// 1
//  Простые данные
// В переменной хранится возраст пользователя. Ему может быть 0 лет. Как
// назвать переменную?

let userAge = 0;
// возраст пользователя 0 лет

// 2
//  Флаги состояния
// Нужно отслеживать, авторизован ли пользователь на сайте. Как назвать
// переменную?

let stateUser = true;
// let stateUser = false;
// состояние.пользователь

// 3
//  Коллекции элементов
// В переменной хранится список всех товаров в корзине интернет-магазина. Как
// назвать переменную?

let userCart = [apple, mandarin, banana];
// корзина пользователя с яблоком, мандарином, бананом

// 4
//  Сложные данные (объект)
// В переменной хранится информация о книге: название, автор, год издания,
// количество страниц. Как назвать переменную для всей книги? А для свойств
// внутри неё?

let book = [
  bookName("Песнь льда и пламени"),
  author("Джордж Мартин"),
  yearPublication(1991),
  quantityPages(Infinity),
];

// переменная для всей книги let book
// переменные для свойст внутри книги
// bookName  имя книги
// author автор
// yearPublication год публикации
// quantityPages количество страниц

// сделал переменные которые прочитав понимаешь смысл того что они значат

// 5
//  Вычисляемые значения
// В переменную записывается общая сумма всех товаров в корзине после
// применения всех скидок. Как назвать переменную?

let totalSumCart = 30000;

// общая сумма корзины

// 6
//  События и таймеры
// В переменной — ID таймера, запускающего действие каждые 5 секунд.
// Переменная нужна, чтобы позже его остановить. Как назвать переменную?

let timerId;

// 7
//  Элементы DOM
// Нужно работать с кнопкой в интерфейсе, нажатие на которую открывает
// модальное окно. Как назвать переменную, которая ссылается на эту HTML
// кнопку?

let modalWindow;

// 8 Булевы значения (да/нет)
// Переменная отвечает на вопрос: «Отображён ли сейчас этот попап на экране?».
// Как назвать переменную?

let isPopupWindow;

// 9
//  Строки для отображения
// В переменной собирается приветственное сообщение для пользователя,
// например «Добро пожаловать, [Имя]!». Как назвать переменную?

let messageName;

// 10
// Функции-обработчики
// Создаётся функция, которая будет вызвана при отправке пользователем
// формы регистрации. Как назвать эту функцию?

let handleFormRegistrationSubmit;
